Catalogs/Renault_КонвертацияДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_КонвертацияДанных</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВнешниеМетаданные</Name>
					<Comment>Источник</Comment>
					<Type>
						<v8:Type>cfg:ExternalDataSourceTableRef.Renault_ПередачаДанныхВСторонниеСистемы.ОбъектыМД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Правило</Name>
					<Comment>Правило постобработки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Правила</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПравилоПоиска</Name>
					<Comment>Правило постобработки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_Правила</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоЧтение</Name>
					<Comment>Осуществляет поиск без загрузки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Активно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВнешнийРеквизит</Name>
							<Comment>Источник</Comment>
							<Type>
								<v8:Type>cfg:ExternalDataSourceTableRef.Renault_ПередачаДанныхВСторонниеСистемы.РеквизитыМД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Comment>Приемник</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Правило</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_Правила</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоПоиска</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_Правила</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоЧтение</Name>
							<Comment>Осуществляет поиск без загрузки</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поиск</Name>
							<Comment>Отмечаются реквизиты по которым осуществляется поиск</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_КонвертацияДанных/Ext/ObjectModule.bsl
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
	//Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)   
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//Если ЭтоГруппа Тогда Возврат КонецЕсли;
	
	//проверка заполнения
	МассивНеНайденныхТипов=Новый Массив;
	Если Не Справочники.Renault_КонвертацияДанных.ВыполнитьПроверкуМетаданных(ЭтотОбъект,МассивНеНайденныхТипов) Тогда 
		//Отказ=Истина 
	КонецЕсли;
	
	//проверка существования общего реквизита Renault_ВерсияВнешнихДанных
	Если Найти(Наименование,"РегистрСведений.")=0 Тогда
		Запрос=Новый Запрос("Выбрать Первые 1 Renault_ВерсияВнешнихДанных Из "+Наименование);
		Попытка Запрос.Выполнить() Исключение
			Активно=Ложь;
			Сообщить("Для метаданных <"+Наименование+"> необходимо в конфигураторе включить использование общего реквизита <Renault_ВерсияВнешнихДанных>, а пока элемент будет не активным",СтатусСообщения.Внимание);
		КонецПопытки;	
	КонецЕсли;
	
	//проверка существования полей поиска
	Если Активно И Найти(Наименование,"РегистрСведений.")>0 И Реквизиты.Количество()>0 Тогда
		Если Реквизиты.НайтиСтроки(Новый Структура("Поиск",Истина)).Количество()=0 Тогда
			Отказ=Истина;
			Сообщить("Для <"+Наименование+"> не определены поля поика (Измерения РегистраСведений)",СтатусСообщения.Внимание);
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//не должно быть 2х активных (дублирования метаданных)
	//Если ЭтоГруппа Тогда 
	//	Запрос=Новый Запрос("Выбрать 1 Из Справочник.Renault_КонвертацияДанных ГДЕ Наименование=&Наименование И Ссылка<>&Ссылка");
	//	Запрос.УстановитьПараметр("Наименование",Наименование);
	//	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	//	Если Не Запрос.Выполнить().Пустой() Тогда
	//		Отказ=Истина;
	//		Сообщить("Группа метаданных <"+Наименование+"> уже существует",СтатусСообщения.Информация);
	//	КонецЕсли;
	//Иначе
		Если Активно Тогда
			Запрос=Новый Запрос("Выбрать 1 Из Справочник.Renault_КонвертацияДанных ГДЕ Наименование=&Наименование И Активно И Ссылка<>&Ссылка");
			Запрос.УстановитьПараметр("Наименование",Наименование);
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Если Не Запрос.Выполнить().Пустой() Тогда
				Отказ=Истина;
				Сообщить("Описание метаданных <"+Наименование+"> уже существует",СтатусСообщения.Информация);
			КонецЕсли;
		КонецЕсли;	
	//КонецЕсли;
	
КонецПроцедуры
